app/controllers/evenements_controller.rb

SELECT "evenements".* FROM "evenements"
---
  def index
    @evenements = Evenement.all

SELECT  "evenements".* FROM "evenements" WHERE "evenements"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "commentaires".* FROM "commentaires" WHERE "commentaires"."evenement_id" = $1 LIMIT $2  [["evenement_id", 1], ["LIMIT", 1]]
---
  def show
    if user_signed_in?
    @evenement = Evenement.find(params[:id])
    @comments = Commentaire.where(evenement_id: @evenement.id)

INSERT INTO "evenements" ("titre", "description", "date", "price", "category_id", "organisateur_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @evenement = Evenement.new(evenement_params)
    @evenement.user_id = current_user.id
    respond_to do |format|
      if @evenement.save

UPDATE "evenements" SET "category_id" = $1, "date" = $2, "updated_at" = $3 WHERE "evenements"."id" = $4  [["category_id", 1], ["date", "2018-06-07 07:00:00"], ["updated_at", "2018-06-07 07:00:46.251535"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @evenement.update(evenement_params)

SELECT  "evenements".* FROM "evenements" WHERE "evenements"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "commentaires" ("comment", "evenement_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["comment", "    Ovy Itokiana"], ["evenement_id", 1], ["created_at", "2018-06-07 10:56:24.581157"], ["updated_at", "2018-06-07 10:56:24.581157"]]
---
  def newcomment
    # @evenement = Evenement.find(params[:id])
    @new = Commentaire.new
    @new.comment = params['comment']
    @new.evenement = Evenement.find(params[:id_en_cours])
    @new.save

SELECT  "evenements".* FROM "evenements" WHERE "evenements"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_evenement
      @evenement = Evenement.find(params[:id])