app/controllers/evenements_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "organisateurs".* FROM "organisateurs" WHERE "organisateurs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def create
    @categories = Category.all
    @organisateurs = Organisateur.where(user_id: current_user.id)

    @evenement = Evenement.new(evenement_params)
    cat = Category.find(params[:category_id])
    org = Organisateur.find(params[:organisateur_id])