app/views/evenements/index.html.erb

                                  <ul class="blog_meta list_style">
                                      <li><a href="#"><%= User.find(e.organisateur.user_id).name %><i class="lnr lnr-user"></i></a></li>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 5], ["LIMIT", 1]]